; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	spectrograph3 - mode
	thermograph0 - mode
	infrared1 - mode
	spectrograph2 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation7 - direction
	GroundStation8 - direction
	GroundStation5 - direction
	Star4 - direction
	GroundStation9 - direction
	GroundStation6 - direction
	GroundStation11 - direction
	Star10 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 infrared1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation11)
	(calibration_target instrument0 GroundStation9)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 spectrograph2)
	(supports instrument1 infrared1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star4)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation6)
	(calibration_target instrument2 GroundStation9)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument3 infrared1)
	(supports instrument3 spectrograph3)
	(calibration_target instrument3 Star10)
	(calibration_target instrument3 GroundStation11)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation6)
)
(:goal (and
	(pointing satellite0 GroundStation7)
	(have_image Planet12 spectrograph2)
	(have_image Phenomenon13 spectrograph3)
	(have_image Planet14 thermograph0)
))

)

; plan
1. (turn_to satellite1 groundstation11 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 groundstation11)
   goals met: 0 of 4
2. (turn_to satellite0 star4 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star4)
   goals met: 0 of 4
3. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 4
4. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 4
5. (calibrate satellite0 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 0 of 4
6. (calibrate satellite1 instrument3 groundstation11)
   added: (calibrated instrument3)
   goals met: 0 of 4
7. (turn_to satellite0 planet12 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 planet12)
   goals met: 0 of 4
8. (take_image satellite0 planet12 instrument1 spectrograph2)
   added: (have_image planet12 spectrograph2)
   goals met: 1 of 4
9. (turn_to satellite0 planet14 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet14)
   goals met: 1 of 4
10. (take_image satellite0 planet14 instrument1 thermograph0)
   added: (have_image planet14 thermograph0)
   goals met: 2 of 4
11. (turn_to satellite0 groundstation7 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 groundstation7)
   goals met: 3 of 4
12. (turn_to satellite1 phenomenon13 groundstation11)
   deleted: (pointing satellite1 groundstation11)
   added: (pointing satellite1 phenomenon13)
   goals met: 3 of 4
13. (take_image satellite1 phenomenon13 instrument3 spectrograph3)
   added: (have_image phenomenon13 spectrograph3)
   goals met: 4 of 4
